#! python3
# -*- coding:utf-8 -*-
'''
Title: 功能坐标
Description: 该文件为功能鼠标点击文件，支持修改
@author: Xushenwei
@update: 2017年1月15日
'''


# 合同管理新增、编辑、删除
# BECivil一级坐标位置
系统 		= (80, 40)
沙盘 		= (150, 40)
视图 		= (220, 40)
操作 		= (290, 40)
资料 		= (360, 40)
数据 		= (430, 40)
协作 		= (500, 40)
样式 		= (570, 40)
任务 		= (640, 40)


# BECivil二级坐标位置-系统
上传工程 	= (40, 90)
打开工程 	= (110, 90)
下载工程 	= (182, 90)
本地任务 	= (252, 90)
创建工作集 	= (323, 90)
打开工作集	= (406, 90)
指定基点 	= (474, 90)
管理工作集 	= (542, 90)
清除 		= (612, 90)
退出 		= (693, 90)
指定关联	= (776, 90)


# BECivil二级坐标位置-沙盘
沙盘模式 	= (42, 90)
工程时间	= (112, 90)
天			= (181, 90)
定义状态	= (263, 90)
格式刷		= (333, 90)
状态管理	= (401, 90)
统计面板	= (473, 90)
状态统计	= (543, 90)
刷新数据	= (615, 90)
插入监控	= (689, 90)
监控管理	= (765, 90)
服务设置	= (834, 90)
监控面板	= (905, 90)
沙盘驾驶舱	= (984, 90)
上传图片	= (1067, 90)

# BECivil二级坐标位置-视图
# ****** 暂不做 ******

# BECivil二级坐标位置-操作
构建过滤	= (40, 90)
构件搜索	= (109, 90)
查看零件	= (185, 90)
构建成组	= (265, 90)
查看组		= (334, 90)
成组管理	= (402, 90)
构件信息	= (482, 90)
属性扩展	= (556, 90)
属性编辑	= (628, 90)
属性统计	= (696, 90)
构件隐藏	= (774, 90)# ***暂不做***
取消隐藏	= (843, 90)# ***暂不做***
任务提醒	= (923, 90)
提醒管理	= (995, 90)
插入节点	= (1076, 90)
节点管理	= (1146, 90)
三维量取	= (1232, 90)# ***暂不做***
标注颜色	= (1300, 90)# ***暂不做***
剖切面		= (1378, 90)# ***暂不做***
退出剖切	= (1446, 90)# ***暂不做***
导出二维码 	= (1530, 90)

# BECivil二级坐标位置-资料
上传资料	= (40, 90)
资料管理	= (110, 90)
质检计量	= (192, 90)

# BECivil二级坐标位置-数据
查看报表	= (40, 90)
对应出量	= (110, 90)
计算产值	= (183, 90)

# BECivil二级坐标位置-协作
协作管理	= (42, 90)
企业模板	= (125, 90)
报告管理	= (194, 90)

# BECivil二级坐标位置-样式
# ****** 暂不做 ******

# BECivil二级坐标位置-任务
测点管理	= (42, 90)
监测报告	= (114, 90)
设置		= (185, 90)

# BECivil二级坐标位置-会员中心
更改用户	= (42, 90)
注册账号	= (114, 90)
我的鲁班	= (185, 90)
更改企业	= (265, 90)
EDS系统		= (330, 90)
鲁班大学	= (414, 90)
鲁班官网	= (484, 90)
关于		= (555, 90)
问题反馈	= (635, 90)